#+TITLE: Resume Data

*** twentyitem/twentyitemshort
These use:
+ ~orgtbl-to-generic~ :: to break the org table down,
+ ~org-combine-plists~ :: to construct a proper =\begin...end{twenty}= container, separating items by new lines.
#+NAME: ticonv
#+BEGIN_SRC elisp :exports none
(defun orgtbl-to-twentyitem (table params)
       "Convert the orgtbl-mode TABLE to a TwentySeconds CV {twentyitem} table."
       (orgtbl-to-generic
        table
        (org-combine-plists
         '(:tstart "\\begin{twenty}" :tend "\\end{twenty}" :lstart "  \\twentyitem\n" :lend "" :fmt "    {%s}" :llfmt "" :sep "\n")
         params)))

(defun orgtbl-to-twentyitemshort (table params)
       "Convert the orgtbl-mode TABLE to a TwentySeconds CV {twentyitemshort} table."
       (orgtbl-to-generic
        table
        (org-combine-plists
         '(:tstart "\\begin{twentyshort}" :tend "\\end{twentyshort}" :lstart "  \\twentyitemshort\n" :lend "" :fmt "    {%s}" :llfmt "" :sep "\n")
         params)))
#+END_SRC

#+RESULTS: ticonv
: orgtbl-to-twentyitemshort

#+NAME: maketi
#+BEGIN_SRC elisp :var tb=education-table :var params='(:skip 2) :results latex :exports results :prologue ticonv
(orgtbl-to-twentyitem tb params)
#+END_SRC

#+RESULTS: maketi
#+begin_export latex
\begin{twenty}
  \twentyitem
    {since 1865}
    {Ph.D. {\normalfont candidate in Computer Science}}
    {Wonderland}
    {\emph{A Quantified Theory of Social Cohesion}}
  \twentyitem
    {1863-1865}
    {M.Sc. magna cum laude}
    {Wonderland}
    {Majoring in Computer Science}
  \twentyitem
    {1861-1863}
    {B.Sc. magna cum laude}
    {Wonderland}
    {Majoring in Computer Science}
  \twentyitem
    {1861-1863}
    {High school}
    {Wonderland}
    {Specializing in mathematics and physics.}
\end{twenty}
#+end_export

#+NAME: mktishort
#+BEGIN_SRC elisp :var tb=publications-table :results latex :exports results :prologue ticonv
(orgtbl-to-twentyitemshort tb '(:skip 2))
#+END_SRC

#+RESULTS: mktishort
#+begin_export latex
\begin{twentyshort}
  \twentyitemshort
    {1865}
    {Chapter One, Down the Rabbit Hole.}
  \twentyitemshort
    {1865}
    {Chapter Two, The Pool of Tears.}
  \twentyitemshort
    {1865}
    {Chapter Three,  The Caucus Race and a Long Tale.}
  \twentyitemshort
    {1865}
    {Chapter Four,  The Rabbit Sends a Little Bill.}
  \twentyitemshort
    {1865}
    {Chapter Five,  Advice from a Caterpillar.}
\end{twentyshort}
#+end_export
*** skills/skillstext
These use ~orgtbl-to-orgtbl~ to trim the top rows and the last row, so we're left with just the data we need to work with. The example file has all these skills comma separated on one line. But ~orgtbl-to-<othertable>~ explicitly enters a new line per table row, so I send these to separate functions for the latex processing.

#+NAME: skillsconv
#+BEGIN_SRC elisp :var tb=skills-table :results raw :exports results
(orgtbl-to-orgtbl tb '(:skip 2 :llfmt ""))
#+END_SRC

#+RESULTS: skillsconv
| pursuer of rabbits |    5 |
| good manners       |    4 |
| outgoing           |  4.3 |
| polite             |    4 |
| Java               | 0.01 |

#+NAME: makeskillbar
#+BEGIN_SRC elisp :var tbl=skillsconv :results latex
(concat "\\skills{"
        (mapconcat
         (lambda (x)
           (concat "{" (car x) "/" (cadr x) "}"))
         (org-table-to-lisp tbl) ",")
        "}")
#+END_SRC

#+RESULTS: makeskillbar
#+begin_export latex
\skills{{pursuer of rabbits/5},{good manners/4},{outgoing/4.3},{polite/4},{Java/0.01}}
#+end_export

#+NAME: skillstextconv
#+BEGIN_SRC elisp :var tb=skillstext-table :results raw :exports results
(orgtbl-to-orgtbl tb '(:skip 2 :llfmt ""))
#+END_SRC

#+RESULTS: skillstextconv
| lovely       | 4 |
| narcissistic | 3 |

#+NAME: makeskillstext
#+BEGIN_SRC elisp :var tbl=skillstextconv :results latex
(concat "\\skillstext{"
        (mapconcat
         (lambda (x)
           (concat "{" (car x) "/" (cadr x) "}"))
         (org-table-to-lisp tbl) ",")
        "}")
#+END_SRC

#+RESULTS: makeskillstext
#+begin_export latex
\skillstext{{lovely/4},{narcissistic/3}}
#+end_export

*** Contact/personal info
Similar process as the skills and skilltext, but a little simpler since we do not have to trim the table first.

#+NAME: latex-contact-info
#+BEGIN_SRC elisp :var tbl=contact-table :results latex
(mapconcat (lambda (x) (concat "\\" (car x) "{" (cadr x) "}")) tbl "\n")
#+END_SRC

#+RESULTS: latex-contact-info
#+begin_export latex
\profilepic{alice.jpeg}
\cvname{Alice}
\cvjobtitle{Adventurer}
\cvdate{26 November 1865}
\cvaddress{United Kingdom}
\cvnumberphone{+39 0325658974}
\cvmail{alice@wonderland.com}
\cvsite{http://en.wikipedia.org}
#+end_export
*** recutils/table version
#+HEADER: :data ../resume-data/experience-table.rec
#+begin_src rec
#+end_src

#+RESULTS:
| Start_Date     | End_Date       | Job_title                        | Location                                                    | Description                                                                                                            | Description_2                                                                                | Description_3                                                                                    | Description_4                    |
|----------------+----------------+----------------------------------+-------------------------------------------------------------+------------------------------------------------------------------------------------------------------------------------+----------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------------+----------------------------------|
| September 2017 | June 2019      | "CRM Lynda.com Fellowship"       | "The Evergreen State College, Advancement"                  | "Shadowed the Assistant Director of Advancement Services."                                                             | "Learned how to use the Blackbaud Raiser's Edge Constituent Relationship Management System." | "Assisted with data management and building complex database query views through SQL and Excel." | "Served during campaign events." |
| September 2017 | June 2018      | "Office Manager"                 | "Services and Activities Fee Allocation Board"              | "Reduced budget intake, processing from 5 hours/week to <1 hour by moving from paper budgets to Google Drive, Sheets." | "Trained 12 board members on the function and operations of the Board."                      |                                                                                                  |                                  |
| "June 2017"    | September 2017 | "Enterprise Software Internship" | "The Evergreen State College, Computing and Communications" |                                                                                                                        |                                                                                              |                                                                                                  |                                  |

#+header: :var filename="../resume/experience.tex"
#+begin_src bash
cat experience-table.rec | recfmt -f ../resume-templates/experience.templ > $filename
#+end_src

#+RESULTS:
#+begin_org
file:../resume/experience.tex
#+end_org
